; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   orange_block_1 green_block_1 blue_block_1 red_block_1 black_block_1 orange_block_2 brown_block_1 - block
 )
 (:init (ontable orange_block_1) (on green_block_1 orange_block_1) (ontable blue_block_1) (on red_block_1 blue_block_1) (ontable black_block_1) (on orange_block_2 red_block_1) (on brown_block_1 orange_block_2) (clear green_block_1) (clear black_block_1) (clear brown_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (holding green_block_1)))
 (:constraints (sometime (not (on blue_block_1 orange_block_1))) (sometime-after (not (on blue_block_1 orange_block_1)) (on black_block_1 orange_block_2)) (sometime (clear orange_block_1)) (sometime-before (clear orange_block_1) (or (on black_block_1 orange_block_1) (holding black_block_1))) (sometime (not (on orange_block_2 green_block_1))) (sometime-after (not (on orange_block_2 green_block_1)) (or (holding black_block_1) (ontable brown_block_1))))
 (:metric minimize (total-cost))
)

; plan
1. (unstack brown_block_1 orange_block_2)
   deleted: (on brown_block_1 orange_block_2) (clear brown_block_1) (handempty)
   added: (holding brown_block_1) (clear orange_block_2)
   goals met: 0 of 1
2. (putdown brown_block_1)
   deleted: (holding brown_block_1)
   added: (clear brown_block_1) (handempty) (ontable brown_block_1)
   goals met: 0 of 1
3. (pickup black_block_1)
   deleted: (clear black_block_1) (ontable black_block_1) (handempty)
   added: (holding black_block_1)
   goals met: 0 of 1
4. (stack black_block_1 orange_block_2)
   deleted: (clear orange_block_2) (holding black_block_1)
   added: (handempty) (clear black_block_1) (on black_block_1 orange_block_2)
   goals met: 0 of 1
5. (unstack green_block_1 orange_block_1)
   deleted: (on green_block_1 orange_block_1) (clear green_block_1) (handempty)
   added: (holding green_block_1) (clear orange_block_1)
   goals met: 1 of 1
